-- MySQL dump 10.13  Distrib 8.0.20, for Win64 (x86_64)
--
-- Host: localhost    Database: vppham5
-- ------------------------------------------------------
-- Server version	8.0.20

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `bill`
--

DROP TABLE IF EXISTS `bill`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `bill` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `CANCELED` tinyint(1) DEFAULT '0',
  `COMPLETED` tinyint(1) DEFAULT '0',
  `CONFIRMED` tinyint(1) DEFAULT '0',
  `CREATEDDATE` datetime(3) DEFAULT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bill`
--

LOCK TABLES `bill` WRITE;
/*!40000 ALTER TABLE `bill` DISABLE KEYS */;
INSERT INTO `bill` VALUES (1,NULL,NULL,1,'2021-06-11 16:13:37.248'),(2,NULL,NULL,1,'2021-06-11 16:14:10.620'),(3,NULL,NULL,1,'2021-06-11 16:15:25.446'),(4,NULL,NULL,1,'2021-06-13 21:21:58.886'),(5,NULL,NULL,1,'2021-06-14 14:16:09.278'),(6,NULL,NULL,1,'2021-06-15 21:05:25.573'),(7,NULL,NULL,1,'2021-06-18 16:16:53.330'),(8,NULL,NULL,1,'2021-06-18 17:21:29.422'),(9,NULL,NULL,1,'2021-06-19 09:57:07.365'),(10,NULL,NULL,1,'2021-06-19 10:44:01.404'),(11,NULL,NULL,1,'2021-06-19 10:45:46.791'),(12,NULL,NULL,1,'2021-06-19 10:48:24.932'),(13,NULL,NULL,1,'2021-06-19 10:57:43.611'),(14,NULL,NULL,1,'2021-06-19 11:01:44.317'),(15,NULL,NULL,1,'2021-06-19 11:03:11.752'),(16,NULL,NULL,1,'2021-06-19 11:09:38.161'),(17,NULL,NULL,1,'2021-06-19 11:12:13.352'),(18,NULL,NULL,1,'2021-06-19 13:31:29.385'),(19,NULL,NULL,1,'2021-06-19 13:47:50.532');
/*!40000 ALTER TABLE `bill` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `billdetail`
--

DROP TABLE IF EXISTS `billdetail`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `billdetail` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `AMOUNT` int DEFAULT NULL,
  `DESCRIPTION` varchar(255) DEFAULT NULL,
  `IDBILL` int DEFAULT NULL,
  `IDPRODUCT` int DEFAULT NULL,
  `QUANTITY` int DEFAULT NULL,
  `STATUS` tinyint(1) DEFAULT '0',
  `USERID` int DEFAULT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=443 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `billdetail`
--

LOCK TABLES `billdetail` WRITE;
/*!40000 ALTER TABLE `billdetail` DISABLE KEYS */;
INSERT INTO `billdetail` VALUES (1,12000,'Đã thanh toán vào lúc 2021-06-11T16:13:37.271',1,32,3,1,1),(2,53600,'Đã thanh toán vào lúc 2021-06-11T16:13:37.308',1,1,1,1,1),(3,52000,'Đã thanh toán vào lúc 2021-06-11T16:13:37.330',1,2,1,1,1),(4,57000,'Đã thanh toán vào lúc 2021-06-11T16:13:37.366',1,3,1,1,1),(5,53600,'Đã thanh toán vào lúc 2021-06-11T16:13:37.409',1,4,1,1,1),(6,198000,'Đã thanh toán vào lúc 2021-06-11T16:13:37.434',1,40,2,1,1),(7,398000,'Đã thanh toán vào lúc 2021-06-11T16:13:37.459',1,41,2,1,1),(8,38000,'Đã thanh toán vào lúc 2021-06-11T16:13:37.478',1,18,1,1,1),(9,51000,'Đã thanh toán vào lúc 2021-06-11T16:13:37.505',1,19,1,1,1),(10,59000,'Đã thanh toán vào lúc 2021-06-11T16:13:37.532',1,20,1,1,1),(11,4000,'Đã thanh toán vào lúc 2021-06-11T16:13:37.555',1,28,1,1,1),(12,7000,'Đã thanh toán vào lúc 2021-06-11T16:13:37.572',1,30,1,1,1),(13,4000,'Đã thanh toán vào lúc 2021-06-11T16:13:37.596',1,31,1,1,1),(14,12000,'Đã thanh toán vào lúc 2021-06-11T16:14:10.634',2,32,3,1,1),(15,107200,'Đã thanh toán vào lúc 2021-06-11T16:14:10.659',2,1,2,1,1),(16,198000,'Đã thanh toán vào lúc 2021-06-11T16:14:10.679',2,40,2,1,1),(17,796000,'Đã thanh toán vào lúc 2021-06-11T16:14:10.697',2,41,4,1,1),(18,75000,'Đã thanh toán vào lúc 2021-06-11T16:15:25.464',3,24,1,1,1),(19,23000,'Đã thanh toán vào lúc 2021-06-11T16:15:25.492',3,25,1,1,1),(20,160800,'Đã thanh toán vào lúc 2021-06-13T21:21:59.290',4,1,3,1,1),(21,208000,'Đã thanh toán vào lúc 2021-06-13T21:21:59.330',4,2,4,1,1),(22,99000,'Đã thanh toán vào lúc 2021-06-13T21:21:59.353',4,40,1,1,1),(23,199000,'Đã thanh toán vào lúc 2021-06-13T21:21:59.459',4,41,1,1,1),(24,4000,'Đã thanh toán vào lúc 2021-06-14T14:16:09.305',5,32,1,1,1),(25,53600,'Đã thanh toán vào lúc 2021-06-14T14:16:09.343',5,1,1,1,1),(26,53600,'Đã thanh toán vào lúc 2021-06-15T21:05:25.685',6,1,1,1,51),(27,52000,'Đã thanh toán vào lúc 2021-06-15T21:05:25.722',6,2,1,1,51),(28,22000,'Đã thanh toán vào lúc 2021-06-15T21:05:25.739',6,10,1,1,51),(29,53600,'Đã thanh toán vào lúc 2021-06-18T16:16:53.996',7,1,1,1,1),(30,52000,'Đã thanh toán vào lúc 2021-06-18T16:16:54.039',7,2,1,1,1),(31,199000,'Đã thanh toán vào lúc 2021-06-18T17:21:29.528',8,41,1,1,1),(32,375200,'Đã thanh toán vào lúc 2021-06-19T09:57:07.491',9,1,7,1,2453),(33,1768000,'Đã thanh toán vào lúc 2021-06-19T09:57:07.535',9,2,34,1,2453),(34,1938000,'Đã thanh toán vào lúc 2021-06-19T09:57:07.632',9,3,34,1,2453),(35,1822400,'Đã thanh toán vào lúc 2021-06-19T09:57:07.754',9,4,34,1,2453),(36,102000,'Đã thanh toán vào lúc 2021-06-19T09:57:07.866',9,5,6,1,2453),(37,578000,'Đã thanh toán vào lúc 2021-06-19T09:57:07.907',9,6,34,1,2453),(38,408000,'Đã thanh toán vào lúc 2021-06-19T09:57:07.941',9,7,34,1,2453),(39,3808000,'Đã thanh toán vào lúc 2021-06-19T09:57:07.980',9,8,34,1,2453),(40,3230000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.011',9,9,34,1,2453),(41,748000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.044',9,10,34,1,2453),(42,986000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.074',9,11,34,1,2453),(43,272000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.107',9,12,34,1,2453),(44,646000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.136',9,13,34,1,2453),(45,261800,'Đã thanh toán vào lúc 2021-06-19T09:57:08.176',9,14,34,1,2453),(46,408000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.209',9,15,34,1,2453),(47,612000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.238',9,16,34,1,2453),(48,261800,'Đã thanh toán vào lúc 2021-06-19T09:57:08.271',9,17,34,1,2453),(49,1292000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.302',9,18,34,1,2453),(50,1734000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.341',9,19,34,1,2453),(51,2006000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.370',9,20,34,1,2453),(52,1632000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.426',9,21,34,1,2453),(53,1564000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.491',9,22,34,1,2453),(54,1564000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.548',9,23,34,1,2453),(55,2550000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.601',9,24,34,1,2453),(56,782000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.654',9,25,34,1,2453),(57,3230000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.690',9,26,34,1,2453),(58,714000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.743',9,27,34,1,2453),(59,136000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.790',9,28,34,1,2453),(60,221000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.823',9,29,34,1,2453),(61,238000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.863',9,30,34,1,2453),(62,136000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.905',9,31,34,1,2453),(63,136000,'Đã thanh toán vào lúc 2021-06-19T09:57:08.952',9,32,34,1,2453),(64,119000,'Đã thanh toán vào lúc 2021-06-19T09:57:09.022',9,33,34,1,2453),(65,102000,'Đã thanh toán vào lúc 2021-06-19T09:57:09.062',9,34,34,1,2453),(66,1224000,'Đã thanh toán vào lúc 2021-06-19T09:57:09.108',9,35,34,1,2453),(67,1224000,'Đã thanh toán vào lúc 2021-06-19T09:57:09.139',9,36,34,1,2453),(68,3196000,'Đã thanh toán vào lúc 2021-06-19T09:57:09.162',9,37,34,1,2453),(69,68000,'Đã thanh toán vào lúc 2021-06-19T09:57:09.187',9,38,34,1,2453),(70,816000,'Đã thanh toán vào lúc 2021-06-19T09:57:09.270',9,39,34,1,2453),(71,3366000,'Đã thanh toán vào lúc 2021-06-19T09:57:09.541',9,40,34,1,2453),(72,6766000,'Đã thanh toán vào lúc 2021-06-19T09:57:09.672',9,41,34,1,2453),(73,61166000,'Đã thanh toán vào lúc 2021-06-19T09:57:09.757',9,42,34,1,2453),(74,98566000,'Đã thanh toán vào lúc 2021-06-19T09:57:09.820',9,43,34,1,2453),(75,6766000,'Đã thanh toán vào lúc 2021-06-19T09:57:09.890',9,44,34,1,2453),(76,107200,'Đã thanh toán vào lúc 2021-06-19T10:44:01.430',10,1,2,1,2453),(77,1924000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.456',10,2,37,1,2453),(78,114000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.483',10,3,2,1,2453),(79,107200,'Đã thanh toán vào lúc 2021-06-19T10:44:01.508',10,4,2,1,2453),(80,34000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.529',10,5,2,1,2453),(81,34000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.550',10,6,2,1,2453),(82,24000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.570',10,7,2,1,2453),(83,224000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.591',10,8,2,1,2453),(84,190000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.612',10,9,2,1,2453),(85,44000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.637',10,10,2,1,2453),(86,58000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.663',10,11,2,1,2453),(87,16000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.684',10,12,2,1,2453),(88,38000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.710',10,13,2,1,2453),(89,15400,'Đã thanh toán vào lúc 2021-06-19T10:44:01.731',10,14,2,1,2453),(90,24000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.748',10,15,2,1,2453),(91,36000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.768',10,16,2,1,2453),(92,15400,'Đã thanh toán vào lúc 2021-06-19T10:44:01.788',10,17,2,1,2453),(93,76000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.813',10,18,2,1,2453),(94,102000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.836',10,19,2,1,2453),(95,118000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.861',10,20,2,1,2453),(96,96000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.891',10,21,2,1,2453),(97,92000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.931',10,22,2,1,2453),(98,92000,'Đã thanh toán vào lúc 2021-06-19T10:44:01.963',10,23,2,1,2453),(99,150000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.001',10,24,2,1,2453),(100,46000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.039',10,25,2,1,2453),(101,190000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.134',10,26,2,1,2453),(102,42000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.195',10,27,2,1,2453),(103,8000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.255',10,28,2,1,2453),(104,13000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.331',10,29,2,1,2453),(105,14000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.377',10,30,2,1,2453),(106,8000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.404',10,31,2,1,2453),(107,8000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.428',10,32,2,1,2453),(108,7000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.451',10,33,2,1,2453),(109,6000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.472',10,34,2,1,2453),(110,72000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.491',10,35,2,1,2453),(111,72000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.520',10,36,2,1,2453),(112,188000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.540',10,37,2,1,2453),(113,4000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.558',10,38,2,1,2453),(114,48000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.581',10,39,2,1,2453),(115,198000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.600',10,40,2,1,2453),(116,398000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.623',10,41,2,1,2453),(117,3598000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.645',10,42,2,1,2453),(118,5798000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.668',10,43,2,1,2453),(119,398000,'Đã thanh toán vào lúc 2021-06-19T10:44:02.691',10,44,2,1,2453),(120,160800,'Đã thanh toán vào lúc 2021-06-19T10:45:46.823',11,1,3,1,2453),(121,1976000,'Đã thanh toán vào lúc 2021-06-19T10:45:46.854',11,2,38,1,2453),(122,171000,'Đã thanh toán vào lúc 2021-06-19T10:45:46.882',11,3,3,1,2453),(123,160800,'Đã thanh toán vào lúc 2021-06-19T10:45:46.907',11,4,3,1,2453),(124,51000,'Đã thanh toán vào lúc 2021-06-19T10:45:46.942',11,5,3,1,2453),(125,51000,'Đã thanh toán vào lúc 2021-06-19T10:45:46.976',11,6,3,1,2453),(126,36000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.009',11,7,3,1,2453),(127,336000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.049',11,8,3,1,2453),(128,380000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.090',11,9,4,1,2453),(129,88000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.123',11,10,4,1,2453),(130,116000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.154',11,11,4,1,2453),(131,32000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.201',11,12,4,1,2453),(132,76000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.272',11,13,4,1,2453),(133,30800,'Đã thanh toán vào lúc 2021-06-19T10:45:47.323',11,14,4,1,2453),(134,48000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.380',11,15,4,1,2453),(135,72000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.414',11,16,4,1,2453),(136,30800,'Đã thanh toán vào lúc 2021-06-19T10:45:47.437',11,17,4,1,2453),(137,114000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.461',11,18,3,1,2453),(138,153000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.483',11,19,3,1,2453),(139,236000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.507',11,20,4,1,2453),(140,192000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.524',11,21,4,1,2453),(141,138000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.542',11,22,3,1,2453),(142,138000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.562',11,23,3,1,2453),(143,225000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.582',11,24,3,1,2453),(144,69000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.603',11,25,3,1,2453),(145,380000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.624',11,26,4,1,2453),(146,63000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.648',11,27,3,1,2453),(147,12000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.687',11,28,3,1,2453),(148,19500,'Đã thanh toán vào lúc 2021-06-19T10:45:47.716',11,29,3,1,2453),(149,21000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.742',11,30,3,1,2453),(150,12000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.776',11,31,3,1,2453),(151,12000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.810',11,32,3,1,2453),(152,10500,'Đã thanh toán vào lúc 2021-06-19T10:45:47.834',11,33,3,1,2453),(153,9000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.869',11,34,3,1,2453),(154,36000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.911',11,35,1,1,2453),(155,144000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.938',11,36,4,1,2453),(156,282000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.959',11,37,3,1,2453),(157,2000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.979',11,38,1,1,2453),(158,24000,'Đã thanh toán vào lúc 2021-06-19T10:45:47.999',11,39,1,1,2453),(159,99000,'Đã thanh toán vào lúc 2021-06-19T10:45:48.020',11,40,1,1,2453),(160,199000,'Đã thanh toán vào lúc 2021-06-19T10:45:48.041',11,41,1,1,2453),(161,1799000,'Đã thanh toán vào lúc 2021-06-19T10:45:48.071',11,42,1,1,2453),(162,2899000,'Đã thanh toán vào lúc 2021-06-19T10:45:48.095',11,43,1,1,2453),(163,199000,'Đã thanh toán vào lúc 2021-06-19T10:45:48.115',11,44,1,1,2453),(164,214400,'Đã thanh toán vào lúc 2021-06-19T10:48:24.960',12,1,4,1,2453),(165,2028000,'Đã thanh toán vào lúc 2021-06-19T10:48:24.984',12,2,39,1,2453),(166,228000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.003',12,3,4,1,2453),(167,214400,'Đã thanh toán vào lúc 2021-06-19T10:48:25.022',12,4,4,1,2453),(168,68000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.039',12,5,4,1,2453),(169,68000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.057',12,6,4,1,2453),(170,420000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.076',12,7,35,1,2453),(171,3920000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.099',12,8,35,1,2453),(172,3325000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.137',12,9,35,1,2453),(173,770000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.168',12,10,35,1,2453),(174,1015000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.207',12,11,35,1,2453),(175,280000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.246',12,12,35,1,2453),(176,665000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.308',12,13,35,1,2453),(177,269500,'Đã thanh toán vào lúc 2021-06-19T10:48:25.379',12,14,35,1,2453),(178,432000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.442',12,15,36,1,2453),(179,648000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.475',12,16,36,1,2453),(180,277200,'Đã thanh toán vào lúc 2021-06-19T10:48:25.511',12,17,36,1,2453),(181,152000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.538',12,18,4,1,2453),(182,1785000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.561',12,19,35,1,2453),(183,2065000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.584',12,20,35,1,2453),(184,48000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.607',12,21,1,1,2453),(185,46000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.629',12,22,1,1,2453),(186,184000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.653',12,23,4,1,2453),(187,300000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.694',12,24,4,1,2453),(188,92000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.722',12,25,4,1,2453),(189,95000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.745',12,26,1,1,2453),(190,21000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.766',12,27,1,1,2453),(191,16000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.786',12,28,4,1,2453),(192,26000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.807',12,29,4,1,2453),(193,28000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.833',12,30,4,1,2453),(194,16000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.852',12,31,4,1,2453),(195,16000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.875',12,32,4,1,2453),(196,14000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.900',12,33,4,1,2453),(197,12000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.922',12,34,4,1,2453),(198,72000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.944',12,35,2,1,2453),(199,36000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.972',12,36,1,1,2453),(200,376000,'Đã thanh toán vào lúc 2021-06-19T10:48:25.990',12,37,4,1,2453),(201,4000,'Đã thanh toán vào lúc 2021-06-19T10:48:26.013',12,38,2,1,2453),(202,48000,'Đã thanh toán vào lúc 2021-06-19T10:48:26.038',12,39,2,1,2453),(203,198000,'Đã thanh toán vào lúc 2021-06-19T10:48:26.071',12,40,2,1,2453),(204,398000,'Đã thanh toán vào lúc 2021-06-19T10:48:26.099',12,41,2,1,2453),(205,1799000,'Đã thanh toán vào lúc 2021-06-19T10:48:26.131',12,42,1,1,2453),(206,2899000,'Đã thanh toán vào lúc 2021-06-19T10:48:26.164',12,43,1,1,2453),(207,199000,'Đã thanh toán vào lúc 2021-06-19T10:48:26.191',12,44,1,1,2453),(208,321600,'Đã thanh toán vào lúc 2021-06-19T10:57:43.663',13,1,6,1,2453),(209,2132000,'Đã thanh toán vào lúc 2021-06-19T10:57:43.716',13,2,41,1,2453),(210,342000,'Đã thanh toán vào lúc 2021-06-19T10:57:43.746',13,3,6,1,2453),(211,321600,'Đã thanh toán vào lúc 2021-06-19T10:57:43.781',13,4,6,1,2453),(212,102000,'Đã thanh toán vào lúc 2021-06-19T10:57:43.807',13,5,6,1,2453),(213,102000,'Đã thanh toán vào lúc 2021-06-19T10:57:43.845',13,6,6,1,2453),(214,444000,'Đã thanh toán vào lúc 2021-06-19T10:57:43.873',13,7,37,1,2453),(215,4144000,'Đã thanh toán vào lúc 2021-06-19T10:57:43.898',13,8,37,1,2453),(216,3515000,'Đã thanh toán vào lúc 2021-06-19T10:57:43.933',13,9,37,1,2453),(217,814000,'Đã thanh toán vào lúc 2021-06-19T10:57:43.971',13,10,37,1,2453),(218,1073000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.005',13,11,37,1,2453),(219,296000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.045',13,12,37,1,2453),(220,703000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.085',13,13,37,1,2453),(221,284900,'Đã thanh toán vào lúc 2021-06-19T10:57:44.113',13,14,37,1,2453),(222,12000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.147',13,15,1,1,2453),(223,18000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.180',13,16,1,1,2453),(224,7700,'Đã thanh toán vào lúc 2021-06-19T10:57:44.215',13,17,1,1,2453),(225,228000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.244',13,18,6,1,2453),(226,1887000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.277',13,19,37,1,2453),(227,2183000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.311',13,20,37,1,2453),(228,144000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.337',13,21,3,1,2453),(229,138000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.372',13,22,3,1,2453),(230,276000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.412',13,23,6,1,2453),(231,450000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.453',13,24,6,1,2453),(232,138000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.489',13,25,6,1,2453),(233,285000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.522',13,26,3,1,2453),(234,63000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.593',13,27,3,1,2453),(235,24000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.634',13,28,6,1,2453),(236,39000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.740',13,29,6,1,2453),(237,42000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.829',13,30,6,1,2453),(238,24000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.879',13,31,6,1,2453),(239,24000,'Đã thanh toán vào lúc 2021-06-19T10:57:44.970',13,32,6,1,2453),(240,21000,'Đã thanh toán vào lúc 2021-06-19T10:57:45.053',13,33,6,1,2453),(241,18000,'Đã thanh toán vào lúc 2021-06-19T10:57:45.161',13,34,6,1,2453),(242,144000,'Đã thanh toán vào lúc 2021-06-19T10:57:45.239',13,35,4,1,2453),(243,108000,'Đã thanh toán vào lúc 2021-06-19T10:57:45.270',13,36,3,1,2453),(244,564000,'Đã thanh toán vào lúc 2021-06-19T10:57:45.295',13,37,6,1,2453),(245,8000,'Đã thanh toán vào lúc 2021-06-19T10:57:45.321',13,38,4,1,2453),(246,96000,'Đã thanh toán vào lúc 2021-06-19T10:57:45.346',13,39,4,1,2453),(247,396000,'Đã thanh toán vào lúc 2021-06-19T10:57:45.370',13,40,4,1,2453),(248,796000,'Đã thanh toán vào lúc 2021-06-19T10:57:45.393',13,41,4,1,2453),(249,5397000,'Đã thanh toán vào lúc 2021-06-19T10:57:45.422',13,42,3,1,2453),(250,8697000,'Đã thanh toán vào lúc 2021-06-19T10:57:45.444',13,43,3,1,2453),(251,597000,'Đã thanh toán vào lúc 2021-06-19T10:57:45.481',13,44,3,1,2453),(252,375200,'Đã thanh toán vào lúc 2021-06-19T11:01:44.349',14,1,7,1,2453),(253,2184000,'Đã thanh toán vào lúc 2021-06-19T11:01:44.385',14,2,42,1,2453),(254,399000,'Đã thanh toán vào lúc 2021-06-19T11:01:44.421',14,3,7,1,2453),(255,375200,'Đã thanh toán vào lúc 2021-06-19T11:01:44.450',14,4,7,1,2453),(256,119000,'Đã thanh toán vào lúc 2021-06-19T11:01:44.479',14,5,7,1,2453),(257,136000,'Đã thanh toán vào lúc 2021-06-19T11:01:44.523',14,6,8,1,2453),(258,456000,'Đã thanh toán vào lúc 2021-06-19T11:01:44.565',14,7,38,1,2453),(259,4368000,'Đã thanh toán vào lúc 2021-06-19T11:01:44.613',14,8,39,1,2453),(260,3705000,'Đã thanh toán vào lúc 2021-06-19T11:01:44.654',14,9,39,1,2453),(261,858000,'Đã thanh toán vào lúc 2021-06-19T11:01:44.685',14,10,39,1,2453),(262,1131000,'Đã thanh toán vào lúc 2021-06-19T11:01:44.707',14,11,39,1,2453),(263,304000,'Đã thanh toán vào lúc 2021-06-19T11:01:44.727',14,12,38,1,2453),(264,722000,'Đã thanh toán vào lúc 2021-06-19T11:01:44.746',14,13,38,1,2453),(265,292600,'Đã thanh toán vào lúc 2021-06-19T11:01:44.769',14,14,38,1,2453),(266,36000,'Đã thanh toán vào lúc 2021-06-19T11:01:44.801',14,15,3,1,2453),(267,54000,'Đã thanh toán vào lúc 2021-06-19T11:01:44.857',14,16,3,1,2453),(268,23100,'Đã thanh toán vào lúc 2021-06-19T11:01:44.901',14,17,3,1,2453),(269,304000,'Đã thanh toán vào lúc 2021-06-19T11:01:44.960',14,18,8,1,2453),(270,1989000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.011',14,19,39,1,2453),(271,2301000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.036',14,20,39,1,2453),(272,240000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.063',14,21,5,1,2453),(273,230000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.083',14,22,5,1,2453),(274,368000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.105',14,23,8,1,2453),(275,525000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.130',14,24,7,1,2453),(276,161000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.152',14,25,7,1,2453),(277,475000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.188',14,26,5,1,2453),(278,105000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.220',14,27,5,1,2453),(279,28000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.259',14,28,7,1,2453),(280,45500,'Đã thanh toán vào lúc 2021-06-19T11:01:45.290',14,29,7,1,2453),(281,49000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.324',14,30,7,1,2453),(282,28000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.353',14,31,7,1,2453),(283,28000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.383',14,32,7,1,2453),(284,24500,'Đã thanh toán vào lúc 2021-06-19T11:01:45.418',14,33,7,1,2453),(285,21000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.449',14,34,7,1,2453),(286,180000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.473',14,35,5,1,2453),(287,144000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.504',14,36,4,1,2453),(288,658000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.529',14,37,7,1,2453),(289,10000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.554',14,38,5,1,2453),(290,120000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.577',14,39,5,1,2453),(291,495000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.600',14,40,5,1,2453),(292,995000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.625',14,41,5,1,2453),(293,7196000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.643',14,42,4,1,2453),(294,11596000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.663',14,43,4,1,2453),(295,796000,'Đã thanh toán vào lúc 2021-06-19T11:01:45.685',14,44,4,1,2453),(296,428800,'Đã thanh toán vào lúc 2021-06-19T11:03:11.780',15,1,8,1,2453),(297,2236000,'Đã thanh toán vào lúc 2021-06-19T11:03:11.800',15,2,43,1,2453),(298,456000,'Đã thanh toán vào lúc 2021-06-19T11:03:11.818',15,3,8,1,2453),(299,428800,'Đã thanh toán vào lúc 2021-06-19T11:03:11.834',15,4,8,1,2453),(300,119000,'Đã thanh toán vào lúc 2021-06-19T11:03:11.868',15,5,7,1,2453),(301,595000,'Đã thanh toán vào lúc 2021-06-19T11:03:11.890',15,6,35,1,2453),(302,312000,'Đã thanh toán vào lúc 2021-06-19T11:03:11.914',15,12,39,1,2453),(303,741000,'Đã thanh toán vào lúc 2021-06-19T11:03:11.944',15,13,39,1,2453),(304,536000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.168',16,1,10,1,2453),(305,2340000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.187',16,2,45,1,2453),(306,570000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.203',16,3,10,1,2453),(307,536000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.218',16,4,10,1,2453),(308,153000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.235',16,5,9,1,2453),(309,629000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.254',16,6,37,1,2453),(310,24000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.272',16,7,2,1,2453),(311,224000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.291',16,8,2,1,2453),(312,190000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.307',16,9,2,1,2453),(313,44000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.326',16,10,2,1,2453),(314,58000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.345',16,11,2,1,2453),(315,328000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.374',16,12,41,1,2453),(316,779000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.402',16,13,41,1,2453),(317,15400,'Đã thanh toán vào lúc 2021-06-19T11:09:38.425',16,14,2,1,2453),(318,24000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.451',16,15,2,1,2453),(319,36000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.477',16,16,2,1,2453),(320,15400,'Đã thanh toán vào lúc 2021-06-19T11:09:38.502',16,17,2,1,2453),(321,1406000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.525',16,18,37,1,2453),(322,102000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.553',16,19,2,1,2453),(323,118000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.580',16,20,2,1,2453),(324,96000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.605',16,21,2,1,2453),(325,92000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.627',16,22,2,1,2453),(326,138000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.641',16,23,3,1,2453),(327,750000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.656',16,24,10,1,2453),(328,230000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.670',16,25,10,1,2453),(329,190000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.686',16,26,2,1,2453),(330,42000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.702',16,27,2,1,2453),(331,40000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.717',16,28,10,1,2453),(332,65000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.733',16,29,10,1,2453),(333,70000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.748',16,30,10,1,2453),(334,40000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.764',16,31,10,1,2453),(335,40000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.779',16,32,10,1,2453),(336,35000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.794',16,33,10,1,2453),(337,30000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.808',16,34,10,1,2453),(338,288000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.824',16,35,8,1,2453),(339,252000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.838',16,36,7,1,2453),(340,940000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.854',16,37,10,1,2453),(341,6000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.869',16,38,3,1,2453),(342,72000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.884',16,39,3,1,2453),(343,297000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.898',16,40,3,1,2453),(344,597000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.915',16,41,3,1,2453),(345,5397000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.931',16,42,3,1,2453),(346,8697000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.946',16,43,3,1,2453),(347,597000,'Đã thanh toán vào lúc 2021-06-19T11:09:38.962',16,44,3,1,2453),(348,482400,'Đã thanh toán vào lúc 2021-06-19T11:12:13.363',17,1,9,1,2453),(349,104000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.391',17,2,2,1,2453),(350,171000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.414',17,3,3,1,2453),(351,160800,'Đã thanh toán vào lúc 2021-06-19T11:12:13.434',17,4,3,1,2453),(352,51000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.454',17,5,3,1,2453),(353,51000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.474',17,6,3,1,2453),(354,36000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.495',17,7,3,1,2453),(355,336000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.514',17,8,3,1,2453),(356,285000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.534',17,9,3,1,2453),(357,66000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.554',17,10,3,1,2453),(358,87000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.579',17,11,3,1,2453),(359,24000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.599',17,12,3,1,2453),(360,57000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.629',17,13,3,1,2453),(361,23100,'Đã thanh toán vào lúc 2021-06-19T11:12:13.651',17,14,3,1,2453),(362,36000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.670',17,15,3,1,2453),(363,54000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.703',17,16,3,1,2453),(364,23100,'Đã thanh toán vào lúc 2021-06-19T11:12:13.740',17,17,3,1,2453),(365,114000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.776',17,18,3,1,2453),(366,153000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.803',17,19,3,1,2453),(367,177000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.843',17,20,3,1,2453),(368,144000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.880',17,21,3,1,2453),(369,138000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.914',17,22,3,1,2453),(370,138000,'Đã thanh toán vào lúc 2021-06-19T11:12:13.976',17,23,3,1,2453),(371,225000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.004',17,24,3,1,2453),(372,69000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.039',17,25,3,1,2453),(373,285000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.060',17,26,3,1,2453),(374,63000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.082',17,27,3,1,2453),(375,12000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.103',17,28,3,1,2453),(376,13000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.120',17,29,2,1,2453),(377,21000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.136',17,30,3,1,2453),(378,8000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.159',17,31,2,1,2453),(379,8000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.175',17,32,2,1,2453),(380,7000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.194',17,33,2,1,2453),(381,6000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.219',17,34,2,1,2453),(382,72000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.270',17,35,2,1,2453),(383,72000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.305',17,36,2,1,2453),(384,188000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.343',17,37,2,1,2453),(385,4000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.396',17,38,2,1,2453),(386,48000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.445',17,39,2,1,2453),(387,198000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.493',17,40,2,1,2453),(388,398000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.513',17,41,2,1,2453),(389,3598000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.535',17,42,2,1,2453),(390,5798000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.555',17,43,2,1,2453),(391,398000,'Đã thanh toán vào lúc 2021-06-19T11:12:14.581',17,44,2,1,2453),(392,4000,'Đã thanh toán vào lúc 2021-06-19T13:31:29.510',18,32,1,1,2453),(393,536000,'Đã thanh toán vào lúc 2021-06-19T13:31:29.563',18,1,10,1,2453),(394,10500,'Đã thanh toán vào lúc 2021-06-19T13:31:29.598',18,33,3,1,2453),(395,9000,'Đã thanh toán vào lúc 2021-06-19T13:31:29.627',18,34,3,1,2453),(396,1995000,'Đã thanh toán vào lúc 2021-06-19T13:31:29.654',18,3,35,1,2453),(397,108000,'Đã thanh toán vào lúc 2021-06-19T13:31:29.694',18,35,3,1,2453),(398,1876000,'Đã thanh toán vào lúc 2021-06-19T13:31:29.726',18,4,35,1,2453),(399,589600,'Đã thanh toán vào lúc 2021-06-19T13:47:50.573',19,1,11,1,2453),(400,52000,'Đã thanh toán vào lúc 2021-06-19T13:47:50.613',19,2,1,1,2453),(401,2052000,'Đã thanh toán vào lúc 2021-06-19T13:47:50.644',19,3,36,1,2453),(402,1929600,'Đã thanh toán vào lúc 2021-06-19T13:47:50.672',19,4,36,1,2453),(403,221000,'Đã thanh toán vào lúc 2021-06-19T13:47:50.691',19,5,13,1,2453),(404,17000,'Đã thanh toán vào lúc 2021-06-19T13:47:50.713',19,6,1,1,2453),(405,12000,'Đã thanh toán vào lúc 2021-06-19T13:47:50.734',19,7,1,1,2453),(406,112000,'Đã thanh toán vào lúc 2021-06-19T13:47:50.760',19,8,1,1,2453),(407,95000,'Đã thanh toán vào lúc 2021-06-19T13:47:50.781',19,9,1,1,2453),(408,22000,'Đã thanh toán vào lúc 2021-06-19T13:47:50.804',19,10,1,1,2453),(409,29000,'Đã thanh toán vào lúc 2021-06-19T13:47:50.827',19,11,1,1,2453),(410,8000,'Đã thanh toán vào lúc 2021-06-19T13:47:50.863',19,12,1,1,2453),(411,19000,'Đã thanh toán vào lúc 2021-06-19T13:47:50.891',19,13,1,1,2453),(412,15400,'Đã thanh toán vào lúc 2021-06-19T13:47:50.932',19,14,2,1,2453),(413,12000,'Đã thanh toán vào lúc 2021-06-19T13:47:50.963',19,15,1,1,2453),(414,18000,'Đã thanh toán vào lúc 2021-06-19T13:47:50.995',19,16,1,1,2453),(415,7700,'Đã thanh toán vào lúc 2021-06-19T13:47:51.032',19,17,1,1,2453),(416,38000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.087',19,18,1,1,2453),(417,51000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.129',19,19,1,1,2453),(418,59000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.165',19,20,1,1,2453),(419,48000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.200',19,21,1,1,2453),(420,46000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.230',19,22,1,1,2453),(421,46000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.256',19,23,1,1,2453),(422,150000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.281',19,24,2,1,2453),(423,46000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.305',19,25,2,1,2453),(424,95000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.335',19,26,1,1,2453),(425,21000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.353',19,27,1,1,2453),(426,8000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.372',19,28,2,1,2453),(427,26000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.415',19,29,4,1,2453),(428,14000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.449',19,30,2,1,2453),(429,8000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.471',19,31,2,1,2453),(430,8000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.499',19,32,2,1,2453),(431,14000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.527',19,33,4,1,2453),(432,12000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.558',19,34,4,1,2453),(433,144000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.580',19,35,4,1,2453),(434,144000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.621',19,36,4,1,2453),(435,376000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.664',19,37,4,1,2453),(436,8000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.706',19,38,4,1,2453),(437,96000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.764',19,39,4,1,2453),(438,396000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.822',19,40,4,1,2453),(439,796000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.864',19,41,4,1,2453),(440,3598000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.888',19,42,2,1,2453),(441,5798000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.921',19,43,2,1,2453),(442,398000,'Đã thanh toán vào lúc 2021-06-19T13:47:51.958',19,44,2,1,2453);
/*!40000 ALTER TABLE `billdetail` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `cart`
--

DROP TABLE IF EXISTS `cart`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `cart` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `BUYDATE` date DEFAULT NULL,
  `BUYER_USERID` int DEFAULT NULL,
  PRIMARY KEY (`ID`),
  KEY `FK_CART_BUYER_USERID` (`BUYER_USERID`),
  CONSTRAINT `FK_CART_BUYER_USERID` FOREIGN KEY (`BUYER_USERID`) REFERENCES `userinfo` (`UserID`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cart`
--

LOCK TABLES `cart` WRITE;
/*!40000 ALTER TABLE `cart` DISABLE KEYS */;
INSERT INTO `cart` VALUES (1,'2021-06-11',1),(2,'2021-06-13',2453),(3,'2021-06-13',51);
/*!40000 ALTER TABLE `cart` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `cartitem`
--

DROP TABLE IF EXISTS `cartitem`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `cartitem` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `QUANTITY` int DEFAULT NULL,
  `UNITPRICE` int DEFAULT NULL,
  `CART_ID` int DEFAULT NULL,
  `PRODUCT_ID` int DEFAULT NULL,
  PRIMARY KEY (`ID`),
  KEY `FK_CARTITEM_CART_ID` (`CART_ID`),
  KEY `FK_CARTITEM_PRODUCT_ID` (`PRODUCT_ID`),
  CONSTRAINT `FK_CARTITEM_CART_ID` FOREIGN KEY (`CART_ID`) REFERENCES `cart` (`ID`),
  CONSTRAINT `FK_CARTITEM_PRODUCT_ID` FOREIGN KEY (`PRODUCT_ID`) REFERENCES `product` (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=489 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cartitem`
--

LOCK TABLES `cartitem` WRITE;
/*!40000 ALTER TABLE `cartitem` DISABLE KEYS */;
INSERT INTO `cartitem` VALUES (19,25,54600,2,1),(23,16,18000,2,5),(69,2,54600,2,1),(101,1,7500,2,29),(111,1,95000,2,37),(112,1,3000,2,38),(113,1,25000,2,39),(114,1,100000,2,40),(115,1,200000,2,41),(116,1,1800000,2,42),(117,1,2900000,2,43),(118,1,200000,2,44),(450,14,18000,2,5),(451,2,18000,2,6),(452,2,13000,2,7),(453,12,54600,2,1),(454,2,53000,2,2),(455,37,58000,2,3),(456,37,54600,2,4),(457,2,113000,2,8),(458,2,96000,2,9),(459,2,23000,2,10),(460,2,30000,2,11),(461,2,9000,2,12),(462,2,39000,2,18),(463,2,52000,2,19),(464,2,60000,2,20),(465,2,49000,2,21),(466,2,47000,2,22),(467,2,96000,2,26),(468,2,22000,2,27),(469,2,47000,2,23),(470,3,76000,2,24),(471,3,24000,2,25),(472,3,5000,2,28),(473,5,7500,2,29),(474,3,8000,2,30),(475,1,5000,2,31),(476,1,5000,2,32),(477,1,4500,2,33),(478,1,4000,2,34),(479,1,37000,2,35),(480,1,37000,2,36),(481,1,95000,2,37),(482,1,3000,2,38),(483,1,25000,2,39),(484,1,100000,2,40),(485,1,200000,2,41),(486,1,200000,2,44),(487,1,1800000,2,42),(488,1,2900000,2,43);
/*!40000 ALTER TABLE `cartitem` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `category`
--

DROP TABLE IF EXISTS `category`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `category` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `NameCategory` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `category`
--

LOCK TABLES `category` WRITE;
/*!40000 ALTER TABLE `category` DISABLE KEYS */;
INSERT INTO `category` VALUES (1,'Sách'),(2,'Giấy vở '),(3,'Đồ dùng văn phòng'),(4,'Bút và dụng cụ học tập'),(5,'Sản phẩm khác');
/*!40000 ALTER TABLE `category` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `feedback`
--

DROP TABLE IF EXISTS `feedback`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `feedback` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `COMMENT` varchar(255) DEFAULT NULL,
  `CREATEDDATE` date DEFAULT NULL,
  `BUYER_USERID` int DEFAULT NULL,
  `PRODUCT_ID` int DEFAULT NULL,
  PRIMARY KEY (`ID`),
  KEY `FK_FEEDBACK_BUYER_USERID` (`BUYER_USERID`),
  KEY `FK_FEEDBACK_PRODUCT_ID` (`PRODUCT_ID`),
  CONSTRAINT `FK_FEEDBACK_BUYER_USERID` FOREIGN KEY (`BUYER_USERID`) REFERENCES `userinfo` (`UserID`),
  CONSTRAINT `FK_FEEDBACK_PRODUCT_ID` FOREIGN KEY (`PRODUCT_ID`) REFERENCES `product` (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=34 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `feedback`
--

LOCK TABLES `feedback` WRITE;
/*!40000 ALTER TABLE `feedback` DISABLE KEYS */;
INSERT INTO `feedback` VALUES (1,'ZAP','2021-06-19',2453,13),(2,'ZAP','2021-06-19',2453,2),(3,'ZAP','2021-06-19',2453,20),(4,'ZAP','2021-06-19',2453,12),(5,'ZAP','2021-06-19',2453,10),(6,'ZAP','2021-06-19',2453,19),(7,'ZAP','2021-06-19',2453,9),(8,'ZAP','2021-06-19',2453,11),(9,'ZAP','2021-06-19',2453,8),(10,'ZAP','2021-06-19',2453,14),(11,'ZAP','2021-06-19',2453,7),(12,'ZAP','2021-06-19',2453,6),(13,'ZAP','2021-06-19',2453,1),(14,'ZAP','2021-06-19',2453,3),(15,'ZAP','2021-06-19',2453,4),(16,'ZAP','2021-06-19',2453,5),(17,'ZAP','2021-06-19',2453,15),(18,'ZAP','2021-06-19',2453,13),(19,'ZAP','2021-06-19',2453,2),(20,'ZAP','2021-06-19',2453,12),(21,'ZAP','2021-06-19',2453,20),(22,'ZAP','2021-06-19',2453,10),(23,'ZAP','2021-06-19',2453,19),(24,'ZAP','2021-06-19',2453,9),(25,'ZAP','2021-06-19',2453,11),(26,'ZAP','2021-06-19',2453,8),(27,'ZAP','2021-06-19',2453,14),(28,'ZAP','2021-06-19',2453,7),(29,'ZAP','2021-06-19',2453,6),(30,'ZAP','2021-06-19',2453,3),(31,'ZAP','2021-06-19',2453,1),(32,'ZAP','2021-06-19',2453,5),(33,'ZAP','2021-06-19',2453,4);
/*!40000 ALTER TABLE `feedback` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `inventory`
--

DROP TABLE IF EXISTS `inventory`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `inventory` (
  `IDProduct` int NOT NULL,
  `IDSubCategory` int NOT NULL,
  `PriceBuy` int NOT NULL,
  `Quantity` int DEFAULT '0',
  PRIMARY KEY (`IDProduct`,`IDSubCategory`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `inventory`
--

LOCK TABLES `inventory` WRITE;
/*!40000 ALTER TABLE `inventory` DISABLE KEYS */;
INSERT INTO `inventory` VALUES (1,1,40000,-4),(2,1,40000,-274),(3,1,40000,-62),(4,1,40000,-59),(5,2,15000,34),(6,2,15000,-33),(7,2,10000,-57),(8,3,100000,-111),(9,3,90000,-107),(10,4,15000,-58),(11,4,20000,-57),(12,5,5000,-34),(13,5,15000,-135),(14,5,5000,41),(15,6,1000,113),(16,6,1000,83),(17,6,5000,113),(18,7,30000,51),(19,7,40000,-8),(20,7,50000,-8),(21,8,40000,187),(22,8,40000,96),(23,9,40000,84),(24,9,70000,167),(25,9,20000,125),(26,10,86000,45),(27,10,15000,145),(28,11,2500,228),(29,11,4500,228),(30,12,5000,178),(31,12,2500,228),(32,12,2500,231),(33,13,2000,125),(34,13,2000,125),(35,13,30000,85),(36,14,80000,39),(37,14,30000,133),(38,15,1500,93),(39,15,20000,43),(40,16,70000,36),(41,16,150000,8),(42,17,1500000,-32),(43,17,2500000,-37),(44,18,150000,-32),(3102,3101,100000,233);
/*!40000 ALTER TABLE `inventory` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product`
--

DROP TABLE IF EXISTS `product`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `IDSubCategory` int DEFAULT NULL,
  `Name` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `Description` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `Image` varchar(255) DEFAULT NULL,
  `Price` decimal(18,0) DEFAULT NULL,
  `PromotionPrice` decimal(18,0) DEFAULT NULL,
  `CreatedDate` datetime DEFAULT CURRENT_TIMESTAMP,
  `CreatedBy` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  PRIMARY KEY (`ID`),
  CONSTRAINT `product_chk_1` CHECK ((`Price` > 0)),
  CONSTRAINT `product_chk_2` CHECK ((`PromotionPrice` > 0))
) ENGINE=InnoDB AUTO_INCREMENT=3103 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product`
--

LOCK TABLES `product` WRITE;
/*!40000 ALTER TABLE `product` DISABLE KEYS */;
INSERT INTO `product` VALUES (1,1,' Bộ Sách giáo khoa toán lớp 1','Bộ Sách giáo khoa lớp 1, bao gồm:\nTiếng Việt 1 – Tập 1\nTiếng Việt 1- Tập 2\nToán 1\nTự nhiên và xã hội 1\nTập viết 1 – Tập 1\nTập viết 1 – Tập 1','sgk1.jpg',54600,1000,'2020-11-26 22:13:30','Lê Đức Tân'),(2,1,' Bộ Sách giáo khoa toán lớp 2','Bộ Sách giáo khoa lớp 2, bao gồm:\nTiếng Việt 2 – Tập 1\nTiếng Việt 2- Tập 2\nToán 2\nTự nhiên và xã hội 2\nTập viết 2 – Tập 1\nTập viết 2 – Tập 2','sgk2.jpg',53000,1000,'2020-11-26 22:13:30','Lê Đức Tân'),(3,1,' Bộ Sách giáo khoa toán lớp 3','Bộ Sách giáo khoa lớp 3, bao gồm:\nTiếng Việt 3 – Tập 1\nTiếng Việt 3- Tập 2\nToán 3\nTự nhiên và xã hội 3\nTập viết 3 – Tập 1\nTập viết 3 – Tập 1','sgk3.jpg',58000,1000,'2020-11-26 22:13:30','Lê Đức Tân'),(4,1,' Bộ Sách giáo khoa toán lớp 4','Bộ Sách giáo khoa lớp 4, bao gồm:\nTiếng Việt 4/1\nTiếng Việt 4/2\nToán 4\nKhoa học 4\nLịch sử và Địa lí 4\nÂm nhạc 4\nMĩ thuật 4\nĐạo đức 4\nKĩ thuật 4','sgk4.jpg',54600,1000,'2020-11-26 22:13:30','Lê Đức Tân'),(5,2,'Doreamon Truyện Ngắn - Tập 33','Những câu chuyện về chú mèo máy thông minh Doraemon và nhóm bạn Nobita,\n Shizuka, Suneo, Jaian, Dekisugi .','doreamon33.jpg',18000,1000,'2020-11-26 22:13:30','Lê Đức Tân'),(6,2,'Doreamon Truyện Ngắn - Tập 45','Những câu chuyện về chú mèo máy thông minh Doraemon và nhóm bạn Nobita,\n Shizuka, Suneo, Jaian, Dekisugi.','doreamon45.jpg',18000,1000,'2020-11-26 22:13:30','Lê Đức Tân'),(7,2,'Trạng Quỷnh - Tập 336','Trạng Quỷnh là một bộ truyện tranh thiếu nhi nhiều tập của Việt Nam,\n tập truyện đầu tiên mang tên Sao sáng xứ Thanh được Nhà xuất bản Đồng Nai phát hành giữa tháng 6 năm 2003','doreamon33.jpg',13000,1000,'2020-11-26 22:13:30','Lê Đức Tân'),(8,3,'Hoàng Tử Bé - Antoine de Saint-Exupéry (1943)','Hoàng tử bé” kể về sự tò mò, cái đẹp, tình yêu, sự mất mát… \n  được nhìn từ đôi mắt ngây thơ của Hoàng tử bé sống trên một tiểu hành tinh, chàng đã đem lòng yêu một đóa hồng.','htb.jpg',113000,1000,'2020-11-26 22:13:30','Lê Đức Tân'),(9,3,'Mối tình đầu của nàng Bọ Cạp','Mối tình đầu của nàng Bọ Cạp là câu chuyện kể về Kỳ Quyên – “cô nàng hổ báo” trong bộ ba Kỳ Quyên,\n Tiêu Tinh (trong tác phẩm “Chờ một ngày nắng”) và Vệ Nam (trong tác phẩm “Ốc sên chạy”).','mtd.jpg',96000,1000,'2020-11-26 22:13:30','Lê Đức Tân'),(10,4,'Tài Liệu Chuyên Văn 7','Sách tham khảo viết văn hay dành cho học sinh THCS tham khảo , nhất là học sinh lớp 7.','stk7.jpg',23000,1000,'2020-11-26 22:13:30','Lê Đức Tân'),(11,4,'Hướng dẫn học Tin Học lớp 5 - Sách bài tập','Sách bài tập hướng dẫn nhằm nâng cao hiểu biết cho học sinh về Tin học.','stk5.jpg',30000,1000,'2020-11-26 22:13:30','Lê Đức Tân'),(12,5,'Vở South Star Kpop','Số trang	96 trang cả bìa.','vol1.jpg',9000,1000,'2020-11-26 22:13:30','Lê Đức Tân'),(13,5,'Vở Cocktail','Số trang	200 trang không kể bìa.','vol2.jpg',20000,1000,'2020-11-26 22:13:30','Lê Đức Tân'),(14,5,'Vở School Joyful','Số trang	80 trang.','vol3.jpg',8700,1000,'2020-11-26 22:13:30','Lê Đức Tân'),(15,6,'Vở Study Oringa','Số trang	120 trang không kể bìa','vkn1.jpg',13000,1000,'2020-11-26 22:13:30','Lê Đức Tân'),(16,6,'Vở Pupil Oxygen','Công nghệ	Gáy vuông - vào keo lạnh - dán gáy','vkn3.jpg',19000,1000,'2020-11-26 22:13:30','Lê Đức Tân'),(17,6,'Vở kẻ ngang Pattern','Số trang	72 trang','vkn2.jpg',8700,1000,'2020-11-26 22:13:30','Lê Đức Tân'),(18,7,'Sổ bìa bồi Subject A4','Công nghệ sản xuất	Bìa bồi - may gáy - dán gáy','s1.jpg',39000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(19,7,'Sổ lịch da Edition Daily Book','Công nghệ sản xuất	Khâu gáy - vào keo lạnh - cài bìa da','s2.jpg',52000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(20,7,'Sổ Hồng Hà OFFICE A4','Công nghệ sản xuất	May gáy - bồi bìa da','s3.jpg',60000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(21,8,'Cặp càng cua 7P Eagle','Cặp càng cua A4 được làm từ nguyên liệu nhựa PP cao cấp bọc bìa cứng\nCó khóa còng lớn bằng thép mạ chắc chắn\nThuận tiện trong việc lưu trữ và bảo quản tài liệu lâu dài\nCó thể lưu giữ được tối đa 470 tờ giấy A4','ccc1.jpg',49000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(22,8,'Cặp càng cua Office 5P','Cặp càng cua A4 được làm từ nguyên liệu nhựa PP cao cấp bọc bìa cứng\nCó khóa còng lớn bằng thép mạ chắc chắn\nThuận tiện trong việc lưu trữ và bảo quản tài liệu lâu dài\nCó thể lưu giữ được tối đa 300 tờ giấy A4','ccc2.jpg',47000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(23,9,'Cặp trình ký Plastic S10 - A4','Cặp trình ký Plastic S10 được làm từ nguyên liệu nhựa PS không độc hại - thân thiện môi trường\nSản phẩm có độ bền cao - thêm tính năng thước kẻ thuận tiện cho việc kẻ vẽ đo đạc\nLưu trữ được 100 tờ giấy A4','ctk1.jpg',47000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(24,9,'Cặp trình ký Office bìa da khổ F','Cặp trình ký chất liệu bìa da cao cấp sang trọng\nLà sản phẩm phù hợp với các hội nghị hay các buổi hội thảo\nKẹp giữ tài liệu bằng inox chắc chắn có độ bền cao\nCó thể lưu giữ được tối đa 100 tờ giấy A4','ctk2.jpg',76000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(25,9,'Trình ký office A4','Cặp trình ký Office được làm từ nguyên liệu nhựa PP cao cấp\nCòng inox chắc chắn giúp có độ bền cao\nCó thể lưu giữ được tối đa 80 tờ giấy A4\nSản phẩm có móc treo phù hợp để dùng treo các thông báo - quyết định..','ctk3.jpg',24000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(26,10,'Giấy in Hồng Hà Copy Paper A4 80gsm','Giấy in cao cấp xuất xứ Indonesia\nKhông sử dụng chất tẩy trắng gốc Clo - bảo vệ môi trường - an toàn khi sử dụng\nMặt giấy láng mịn - Chất lượng bản in đạt độ sắc nét cao - thích hợp các loại máy in - máy photocopy','gi1.jpg',96000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(27,10,'Giấy in Hồng Hà Copy Paper A4','Giấy in cao cấp xuất xứ Indonesia\nKhông sử dụng chất tẩy trắng gốc Clo - bảo vệ môi trường - an toàn khi sử dụng\nMặt giấy láng mịn - Chất lượng bản in đạt độ sắc nét cao - thích hợp các loại máy in - máy photocopy','gi2.jpg',22000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(28,11,'Túi My Clear Hồng Hà F','Được làm từ vật liệu màng PP trong - độ dày 0.15 mm\nSử dụng để đựng tài liệu - hồ sơ tránh bị cong vênh - bám bụi\nNút bấm có độ bền cao – đường hàn nhiệt chắc chắn\nCó thể lưu giữ được tối đa 300 tờ giấy A4','td1.jpg',5000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(29,11,'Túi 2 ngăn','Sử dụng để đựng tài liệu - hồ sơ tránh bị cong vênh - bám bụi\nNút bấm có độ bền cao – đường hàn nhiệt chắc chắn\nCó thể lưu giữ được tối đa 500 tờ giấy A4','td2.jpg',7500,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(30,12,'Bút bi Thiên Long TL-031','Bút bi Thiên Long TL-031 màu xanh','bi1.jpg',8000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(31,12,'Bút bi Thiên Long TL-079 màu đen','Bút bi Thiên Long TL-079 màu đen','bi2.jpg',5000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(32,12,'Bút bi Thiên Long TL-061 màu đỏ','Bút bi Thiên Long TL-061 màu đỏ','bi3.jpg',5000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(33,13,'Bút chì gỗ Điểm 10 TP-GP08','Bút chì gỗ Điểm 10 TP-GP08 được sử dụng phổ biến tại các văn phòng,\n công sở và hữu ích cho học sinh, sinh viên.\n Bút chì nhỏ gọn, có tính ứng dụng cao và màu viết đẹp nên được tin dùng trong thời gian vừa qua.','chi1.jpg',4500,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(34,13,'Bút chì gỗ Thiên Long GP - 03','Bút chì thích hợp cho các hoạt động như ghi chép, vẽ nháp, \n  học tập. Ngoài ra khá hữu dụng trong việc tô đậm vào ô trả lời trắc nghiệm.','chi2.jpg',4000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(35,13,'Bút Chì Kim Pentel - PD275T','Bút chì bấm hiện nay đã trở thành một công cụ hỗ trợ không thể thiếu đối với mọi người.\n Một cây bút tốt sẽ giúp các bạn rất nhiều trong học tập và công việc. ','chi3.jpg',37000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(36,14,'Bút máy nét hoa Tom & Jerry','Bút máy nét hoa Tom & Jerry luyện chữ viết đẹp dùng cho học sinh tiểu học ','bm1.jpg',37000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(37,14,'Bút máy Hồng Hà nét hoa 300','Bút luyện viết chữ đẹp dùng cho học sinh - sinh viên - văn phòng\nPhong cách thiết kế sang trọng độc đáo. ','bm2.jpg',95000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(38,15,'Mực ống Hồng Hà','Ống mực Hồng Hà cao cấp\nPhù hợp với học sinh tiểu học ','dd1.jpg',3000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(39,15,'Compa SM03','Compa Hồng Hà cao cấp tiện dụng dành cho học sinh - sinh viên\nBề mặt thép sơn tĩnh điện kết cấu vững chắc - độ bền cao\nThiết kế nhỏ gọn - dễ cầm - dễ sử dụng\nĐa dạng kiểu dáng - màu sắc trang nhã bắt mắt ','dd2.jpg',25000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(40,16,'Cặp học sinh Happy Bird','Sản phẩm cặp nhựa dành cho học sinh','c1.jpg',100000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(41,16,'Balo Rainbow LS5092S','Balo Trẻ Em Rainbow LS5092S  được làm từ chất liệu Polyester 600D với đặc tính bền bỉ và giữ được màu sắc tươi sáng theo thời gian.\n Hơn nữa trọng lượng balo cũng rất nhẹ, đảm bảo sức khoẻ và sự phát triển chiều cao cho các bé đang đi học. ','c2.jpg',200000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(42,17,'Bàn học sinh thông minh BHS20','Hiện đại, thông minh, có thể điều chỉnh độ cao bàn, ghế, độ nghiêng mặt bàn.','bh1.jpg',1800000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(43,17,'Bàn học sinh thông minh BHS26X','Hiện đại, thông minh, có thể điều chỉnh độ cao bàn, ghế phù hợp với mọi lứa tuổi ','bh2.jpg',2900000,1000,'2020-11-26 22:13:31','Lê Đức Tân'),(44,18,'Kệ đựng sách trang trí trưng bày sản phẩm lắp ghép thông minh','Những tấm lưới sắt kết hợp vưới chốt nhựa 8 chiều ABS tạo thành những ô vuông với kích thước 350 x 350 x 350 mm. \n Có thể xếp bao nhiêu tầng, bao nhiêu ô tùy thích vào kích thước phòng, nhu cầu sử dụng, tính sáng tạo.  ','ks1.jpg',200000,1000,'2020-11-26 22:13:31','Lê Đức Tân');
/*!40000 ALTER TABLE `product` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `sequence`
--

DROP TABLE IF EXISTS `sequence`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `sequence` (
  `SEQ_NAME` varchar(50) NOT NULL,
  `SEQ_COUNT` decimal(38,0) DEFAULT NULL,
  PRIMARY KEY (`SEQ_NAME`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sequence`
--

LOCK TABLES `sequence` WRITE;
/*!40000 ALTER TABLE `sequence` DISABLE KEYS */;
INSERT INTO `sequence` VALUES ('SEQ_GEN',3150);
/*!40000 ALTER TABLE `sequence` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `subcategory`
--

DROP TABLE IF EXISTS `subcategory`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `subcategory` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `NameSubCategory` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `IDCategory` int DEFAULT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=3102 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `subcategory`
--

LOCK TABLES `subcategory` WRITE;
/*!40000 ALTER TABLE `subcategory` DISABLE KEYS */;
INSERT INTO `subcategory` VALUES (1,'Sách giáo khoa',1),(2,'Truyện tranh',1),(3,'Tiểu thuyết',1),(4,'Sách tham khảo',1),(5,'Vở ô ly',2),(6,'Vở kẻ ngang',2),(7,'Sổ các loại',2),(8,'Cặp càng cua',3),(9,'Cặp trình ký',3),(10,'Giấy in - photo',3),(11,'Túi đựng tài liệu',3),(12,'Bút bi',4),(13,'Bút chì',4),(14,'Bút máy',4),(15,'Dụng cụ học sinh',4),(16,'Ba lô - Túi - Cặp',5),(17,'Bảng - Bàn học ',5),(18,'Kệ sách, vở ',5),(3101,'Máy Bay',5);
/*!40000 ALTER TABLE `subcategory` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `userinfo`
--

DROP TABLE IF EXISTS `userinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `userinfo` (
  `UserID` int NOT NULL AUTO_INCREMENT,
  `UserName` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `Password` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `FirstName` varchar(30) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `LastName` varchar(30) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `Address` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `Email` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `Phone` varchar(15) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `Image` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `Role` bit(1) DEFAULT b'0',
  PRIMARY KEY (`UserID`),
  UNIQUE KEY `UserName` (`UserName`)
) ENGINE=InnoDB AUTO_INCREMENT=2457 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_vietnamese_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `userinfo`
--

LOCK TABLES `userinfo` WRITE;
/*!40000 ALTER TABLE `userinfo` DISABLE KEYS */;
INSERT INTO `userinfo` VALUES (1,'tan','Jj/sWIYUSarMHDKKSv9kr/TGLfSi1Qs/IH+om24kLJqneOeouu/++FtsptLn3Bb/CnYNWcE8I49rzcMvjOnMYg==','Nguyễn','Tân','Đăk Hà','tandepzaiok@gmail.com','0929191413',NULL,_binary ''),(51,'tan240600','Jj/sWIYUSarMHDKKSv9kr/TGLfSi1Qs/IH+om24kLJqneOeouu/++FtsptLn3Bb/CnYNWcE8I49rzcMvjOnMYg==','Tân','Tân','Đăk Hà','superjunior242@gmail.com','0929191413',NULL,_binary '\0'),(101,'tanle','Jj/sWIYUSarMHDKKSv9kr/TGLfSi1Qs/IH+om24kLJqneOeouu/++FtsptLn3Bb/CnYNWcE8I49rzcMvjOnMYg==','Tan','Nguyen','dasdsa sad s sd ','superjunior245@gmail.com','0929191413',NULL,_binary '\0'),(151,'tanle2','s7oMZySbVD/Al4D5O66z5b0izpn/eefRR8f6dcz0QZzabJoSmbJkQAOo5Egmsa3K3HZCO74PyMbJrmZRTynZnw==','Tan','Nguyen','dasdsa sad s sd ','superjunior2425@gmail.com','0929191413',NULL,_binary '\0'),(551,'tan2','Jj/sWIYUSarMHDKKSv9kr/TGLfSi1Qs/IH+om24kLJqneOeouu/++FtsptLn3Bb/CnYNWcE8I49rzcMvjOnMYg==','Tân','Nguyễn','Dak Ha','superjunior242222@gmail.com','0929191413',NULL,_binary '\0'),(651,'tan3','Jj/sWIYUSarMHDKKSv9kr/TGLfSi1Qs/IH+om24kLJqneOeouu/++FtsptLn3Bb/CnYNWcE8I49rzcMvjOnMYg==','Nguyễn ','Tân','Äak Ha','superjunior2412@gmail.com','45464535',NULL,_binary '\0'),(701,'tanle1','Jj/sWIYUSarMHDKKSv9kr/TGLfSi1Qs/IH+om24kLJqneOeouu/++FtsptLn3Bb/CnYNWcE8I49rzcMvjOnMYg==','Hoàng','Lê','Äak Ha','superjunior241122@gmail.com','0929191413',NULL,_binary '\0'),(751,'tandz','mWIg/Ygd4IzhEHbVajrN72WMD8HqVRegM1LMme04cE4gnnWD2HHAS0b9ayf+pU0+WZwJSzob4sEa2lx7B/DlpA==','Nguyá»n ','TÃ¢n','supersasdsa','superjnsas21321','12321312',NULL,_binary '\0'),(1506,'tanne','Jj/sWIYUSarMHDKKSv9kr/TGLfSi1Qs/IH+om24kLJqneOeouu/++FtsptLn3Bb/CnYNWcE8I49rzcMvjOnMYg==','Nguyá»n ','TÃ¢n','Äak Ha Kon Tum','tan240600@gmail.com','0929191413',NULL,_binary '\0'),(2452,'tan2t','Jj/sWIYUSarMHDKKSv9kr/TGLfSi1Qs/IH+om24kLJqneOeouu/++FtsptLn3Bb/CnYNWcE8I49rzcMvjOnMYg==','Nguyễn ','Hoàng','Đak Ha Kon Tum','superjunior243325@gmail.com','0929191413',NULL,_binary '\0'),(2453,'ZAP','AQ0dI1Fgj+V6pL7imCE6JuR1CW0k3CYKybJ7LqSjKn+viPSS2ZOLQBIyDaeZdlKAGUpIzpvdXVVdNLzE3jroqA==','ZAP','ZAP','ZAP','foo-bar@example.com','9999999999',NULL,_binary '\0'),(2454,'tan144','Jj/sWIYUSarMHDKKSv9kr/TGLfSi1Qs/IH+om24kLJqneOeouu/++FtsptLn3Bb/CnYNWcE8I49rzcMvjOnMYg==','21321','231423','12412412','123','123',NULL,_binary '\0'),(2455,'tan21321','Jj/sWIYUSarMHDKKSv9kr/TGLfSi1Qs/IH+om24kLJqneOeouu/++FtsptLn3Bb/CnYNWcE8I49rzcMvjOnMYg==','ádasd','adsadsa','2132131','sadasd','213123',NULL,_binary '\0'),(2456,'tan24','Jj/sWIYUSarMHDKKSv9kr/TGLfSi1Qs/IH+om24kLJqneOeouu/++FtsptLn3Bb/CnYNWcE8I49rzcMvjOnMYg==','Tân','Nguyễn','Đăk Hà','asda ','21321312',NULL,_binary '\0');
/*!40000 ALTER TABLE `userinfo` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-06-19 19:15:43
